Revit 2027 API
BuiltInFailures.RebarFailures.OutSideOfHost Property
 Rebar is placed completely outside of its host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId OutSideOfHost { get; }
Public Shared ReadOnly Property OutSideOfHost As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ OutSideOfHost {
	FailureDefinitionId^ get ();
}
static member OutSideOfHost : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace